package main

import "fmt"

func main() {
	fmt.Println(isValidSudoku([][]byte{
		{'5', '3', '.', '.', '7', '.', '.', '.', '.'},
		{'6', '.', '.', '1', '9', '5', '.', '.', '.'},
		{'.', '9', '8', '.', '.', '.', '.', '6', '.'},
		{'8', '.', '.', '.', '6', '.', '.', '.', '3'},
		{'4', '.', '.', '8', '.', '3', '.', '.', '1'},
		{'7', '.', '.', '.', '2', '.', '.', '.', '6'},
		{'.', '6', '.', '.', '.', '.', '2', '8', '.'},
		{'.', '.', '.', '4', '1', '9', '.', '.', '5'},
		{'.', '.', '.', '.', '8', '.', '.', '7', '9'},
	}))

	//for i := 0; i < 3; i++ {
	//	for j := 0; j < 3; j++ {
	//		fmt.Println(3*i, 3*(i+1), 3*j, 3*(j+1))
	//	}
	//}

	//var x = [][]byte{
	//	{1, 2, 3},
	//	{4, 5, 6},
	//	{7, 8, 9},
	//}
	//
	//fmt.Println(x[:][0])
}

//请你判断一个 9 x 9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。
//
//
// 数字 1-9 在每一行只能出现一次。
// 数字 1-9 在每一列只能出现一次。
// 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
//
//
//
//
// 注意：
//
//
// 一个有效的数独（部分已被填充）不一定是可解的。
// 只需要根据以上规则，验证已经填入的数字是否有效即可。
// 空白格用 '.' 表示。
//
//
//
//
// 示例 1：
//
//
//输入：board =
//[["5","3",".",".","7",".",".",".","."]
//,["6",".",".","1","9","5",".",".","."]
//,[".","9","8",".",".",".",".","6","."]
//,["8",".",".",".","6",".",".",".","3"]
//,["4",".",".","8",".","3",".",".","1"]
//,["7",".",".",".","2",".",".",".","6"]
//,[".","6",".",".",".",".","2","8","."]
//,[".",".",".","4","1","9",".",".","5"]
//,[".",".",".",".","8",".",".","7","9"]]
//输出：true
//
//
// 示例 2：
//
//
//输入：board =
//[["8","3",".",".","7",".",".",".","."]
//,["6",".",".","1","9","5",".",".","."]
//,[".","9","8",".",".",".",".","6","."]
//,["8",".",".",".","6",".",".",".","3"]
//,["4",".",".","8",".","3",".",".","1"]
//,["7",".",".",".","2",".",".",".","6"]
//,[".","6",".",".",".",".","2","8","."]
//,[".",".",".","4","1","9",".",".","5"]
//,[".",".",".",".","8",".",".","7","9"]]
//输出：false
//解释：除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无
//效的。
//
//
//
// 提示：
//
//
// board.length == 9
// board[i].length == 9
// board[i][j] 是一位数字（1-9）或者 '.'
//
// Related Topics 数组 哈希表 矩阵 👍 727 👎 0

//leetcode submit region begin(Prohibit modification and deletion)

// 单词循环
func isValidSudoku(board [][]byte) bool {
	var (
		rows, columns [9][9]int
		subboxes      [3][3][9]int
	)

	for i, row := range board {
		for j, c := range row {
			if c == '.' {
				continue
			}
			var index = c - '1'
			rows[i][index]++
			columns[j][index]++
			subboxes[i/3][j/3][index]++
			if rows[i][index] > 1 || columns[j][index] > 1 || subboxes[i/3][j/3][index] > 1 {
				return false
			}
		}
	}

	return true
}

//leetcode submit region end(Prohibit modification and deletion)

// 省空间
func isValidSudoku_A(board [][]byte) bool {
	var (
		isValid = func(lb, le, wb, we int) bool {
			var (
				m = make(map[byte]struct{})
			)

			for i := lb; i < le; i++ {
				for j := wb; j < we; j++ {
					if board[i][j] == '.' {
						continue
					}

					if _, has := m[board[i][j]]; has {
						return false
					}
					m[board[i][j]] = struct{}{}
				}
			}
			return true
		}
	)

	for i := 0; i < 9; i++ {
		if !isValid(i, i+1, 0, 9) {
			return false
		}

		if !isValid(0, 9, i, i+1) {
			return false
		}
	}

	for i := 0; i < 3; i++ {
		for j := 0; j < 3; j++ {
			if !isValid(3*i, 3*(i+1), 3*j, 3*(j+1)) {
				return false
			}
		}
	}

	return true
}
